spec/support/vcr_cassettes/bgs/rating_web_service/rating_data_single_rating.yml

---
http_interactions:
- request:
    method: get
    uri: <BGS_BASE_URL>/RatingServiceBean/RatingService?WSDL
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Host:
      - ".vba.va.gov"
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Wed, 06 May 2020 13:59:05 GMT
      Server:
      - Apache
      X-Frame-Options:
      - SAMEORIGIN
      Transfer-Encoding:
      - chunked
      Content-Type:
      - text/xml;charset=utf-8
    body:
      encoding: UTF-8
      string: |-
        <?xml version='1.0' encoding='UTF-8'?><!-- Published by JAX-WS RI (http://jax-ws.java.net). RI's version is JAX-WS RI 2.3.0-b170407.2038 svn-revision#2eaca54d17a59d265c6fe886b7fd0027836c766c. --><!-- Generated by JAX-WS RI (http://jax-ws.java.net). RI's version is JAX-WS RI 2.3.0-b170407.2038 svn-revision#2eaca54d17a59d265c6fe886b7fd0027836c766c. --><definitions xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:wsp="http://www.w3.org/ns/ws-policy" xmlns:wsp1_2="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:tns="http://services.share.benefits.vba.va.gov/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns="http://schemas.xmlsoap.org/wsdl/" targetNamespace="http://services.share.benefits.vba.va.gov/" name="RatingWebService">
        <types>
        <xsd:schema>
        <xsd:import namespace="http://services.share.benefits.vba.va.gov/" schemaLocation="http://linktestbepbenefits.vba.va.gov:80/RatingServiceBean/RatingWebService?xsd=1"/>
        </xsd:schema>
        </types>
        <message name="findRatingData">
        <part name="parameters" element="tns:findRatingData"/>
        </message>
        <message name="findRatingDataResponse">
        <part name="parameters" element="tns:findRatingDataResponse"/>
        </message>
        <message name="ShareException">
        <part name="fault" element="tns:ShareException"/>
        </message>
        <message name="findRatingDataByPtcpntId">
        <part name="parameters" element="tns:findRatingDataByPtcpntId"/>
        </message>
        <message name="findRatingDataByPtcpntIdResponse">
        <part name="parameters" element="tns:findRatingDataByPtcpntIdResponse"/>
        </message>
        <portType name="RatingService">
        <operation name="findRatingData">
        <input wsam:Action="http://services.share.benefits.vba.va.gov/RatingService/findRatingDataRequest" message="tns:findRatingData"/>
        <output wsam:Action="http://services.share.benefits.vba.va.gov/RatingService/findRatingDataResponse" message="tns:findRatingDataResponse"/>
        <fault message="tns:ShareException" name="ShareException" wsam:Action="http://services.share.benefits.vba.va.gov/RatingService/findRatingData/Fault/ShareException"/>
        </operation>
        <operation name="findRatingDataByPtcpntId">
        <input wsam:Action="http://services.share.benefits.vba.va.gov/RatingService/findRatingDataByPtcpntIdRequest" message="tns:findRatingDataByPtcpntId"/>
        <output wsam:Action="http://services.share.benefits.vba.va.gov/RatingService/findRatingDataByPtcpntIdResponse" message="tns:findRatingDataByPtcpntIdResponse"/>
        <fault message="tns:ShareException" name="ShareException" wsam:Action="http://services.share.benefits.vba.va.gov/RatingService/findRatingDataByPtcpntId/Fault/ShareException"/>
        </operation>
        </portType>
        <binding name="RatingWebServicePortBinding" type="tns:RatingService">
        <soap:binding transport="http://schemas.xmlsoap.org/soap/http" style="document"/>
        <operation name="findRatingData">
        <soap:operation soapAction=""/>
        <input>
        <soap:body use="literal"/>
        </input>
        <output>
        <soap:body use="literal"/>
        </output>
        <fault name="ShareException">
        <soap:fault name="ShareException" use="literal"/>
        </fault>
        </operation>
        <operation name="findRatingDataByPtcpntId">
        <soap:operation soapAction=""/>
        <input>
        <soap:body use="literal"/>
        </input>
        <output>
        <soap:body use="literal"/>
        </output>
        <fault name="ShareException">
        <soap:fault name="ShareException" use="literal"/>
        </fault>
        </operation>
        </binding>
        <service name="RatingWebService">
        <port name="RatingWebServicePort" binding="tns:RatingWebServicePortBinding">
        <soap:address location="http://linktestbepbenefits.vba.va.gov:80/RatingServiceBean/RatingWebService"/>
        </port>
        </service>
        </definitions>
    http_version: null
  recorded_at: Wed, 06 May 2020 13:59:06 GMT
- request:
    method: post
    uri: <BGS_BASE_URL>/RatingServiceBean/RatingService
    body:
      encoding: UTF-8
      string: |-
        <?xml version="1.0" encoding="UTF-8"?><env:Envelope xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:tns="http://services.share.benefits.vba.va.gov/" xmlns:env="http://schemas.xmlsoap.org/soap/envelope/"><env:Header><wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
          <wsse:UsernameToken>
            <wsse:Username>VAgovAPI</wsse:Username>
          </wsse:UsernameToken>
          <vaws:VaServiceHeaders xmlns:vaws="http://vbawebservices.vba.va.gov/vawss">
            <vaws:CLIENT_MACHINE>10.0.2.15</vaws:CLIENT_MACHINE>
            <vaws:STN_ID>281</vaws:STN_ID>
            <vaws:applicationName>VAgovAPI</vaws:applicationName>
            <vaws:ExternalUid>96014958860400540</vaws:ExternalUid>
            <vaws:ExternalKey>abraham.lincoln@vets.gov</vaws:ExternalKey>
          </vaws:VaServiceHeaders>
        </wsse:Security>
        </env:Header><env:Body><tns:findRatingData><fileNumber>796104437</fileNumber></tns:findRatingData></env:Body></env:Envelope>
    headers:
      Host:
      - ".vba.va.gov"
      Soapaction:
      - '"findRatingData"'
      Content-Type:
      - text/xml;charset=UTF-8
      Content-Length:
      - '995'
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Wed, 06 May 2020 13:59:06 GMT
      Server:
      - Apache
      X-Frame-Options:
      - SAMEORIGIN
      X-Oracle-Dms-Ecid:
      - 8d103b50-b9da-40c3-ac2f-0e051413bb46-000000bd
      X-Oracle-Dms-Rid:
      - '0'
      Transfer-Encoding:
      - chunked
      Content-Type:
      - text/xml; charset=utf-8
    body:
      encoding: UTF-8
      string: <?xml version='1.0' encoding='UTF-8'?><S:Envelope xmlns:env="http://schemas.xmlsoap.org/soap/envelope/"
        xmlns:S="http://schemas.xmlsoap.org/soap/envelope/"><env:Header><work:WorkContext
        xmlns:work="http://oracle.com/weblogic/soap/workarea/">rO0ABXdUAB13ZWJsb2dpYy5hcHAuQ29ycG9yYXRlRGF0YUVBUgAAANYAAAAjd2VibG9naWMud29ya2FyZWEuU3RyaW5nV29ya0NvbnRleHQABjMuMS4xMwAA</work:WorkContext></env:Header><S:Body><ns0:findRatingDataResponse
        xmlns:ns0="http://services.share.benefits.vba.va.gov/"><return><deathRatingRecord><numberOfRecords>0</numberOfRecords><returnCode>SHAR
        9999</returnCode><returnMessage>Records found</returnMessage></deathRatingRecord><disabilityRatingRecord><combinedDegreeEffectiveDate>01012019</combinedDegreeEffectiveDate><legalEffectiveDate>12312018</legalEffectiveDate><nonServiceConnectedCombinedDegree>100</nonServiceConnectedCombinedDegree><numberOfRecords>1</numberOfRecords><promulgationDate>01022019</promulgationDate><ratings><beginDate>01012005</beginDate><bilateralTypeName></bilateralTypeName><combatIndicator>N</combatIndicator><diagnosticPercent>100</diagnosticPercent><diagnosticText>Hearing
        Loss</diagnosticText><diagnosticTypeCode>6100</diagnosticTypeCode><diagnosticTypeName>6100-Hearing
        loss</diagnosticTypeName><disabilityDate>12212018</disabilityDate><disabilityDecisionTypeCode>SVCCONNCTED</disabilityDecisionTypeCode><disabilityDecisionTypeName>Service
        Connected</disabilityDecisionTypeName><disabilityID>1128271</disabilityID><endDate></endDate><futureExamDate></futureExamDate><hyphenatedDiagnosticTypeCode></hyphenatedDiagnosticTypeCode><hyphenatedDiagnosticTypeName></hyphenatedDiagnosticTypeName><hyphenatedRelatedDisabilityTypeName></hyphenatedRelatedDisabilityTypeName><lastExamDate></lastExamDate><majorIndicator>N</majorIndicator><militaryServicePeriodTypeName>Peacetime</militaryServicePeriodTypeName><paragraphTypeName></paragraphTypeName><previousServicePercent></previousServicePercent><relatedDisabilityTypeName></relatedDisabilityTypeName><supplementalDecisionTypeName></supplementalDecisionTypeName><withholdingPercent></withholdingPercent><withholdingTypeName></withholdingTypeName></ratings><returnCode>SHAR
        9999</returnCode><returnMessage>Records found</returnMessage><serviceConnectedCombinedDegree>100</serviceConnectedCombinedDegree></disabilityRatingRecord><familyMemberRatingRecord><numberOfRecords>0</numberOfRecords><returnCode>SHAR
        9999</returnCode><returnMessage>Records found</returnMessage></familyMemberRatingRecord><otherRatingRecord><numberOfRecords>1</numberOfRecords><ratings><beginDate>01012005</beginDate><decisionTypeName>Ancillary</decisionTypeName><disabilityTypeName>Basic
        Eligibility under 38 USC Ch 35</disabilityTypeName><endDate></endDate><ratingDate>12212018</ratingDate><supplementalDecisionTypeName></supplementalDecisionTypeName></ratings><returnCode>SHAR
        9999</returnCode><returnMessage>Records found</returnMessage></otherRatingRecord><specialMonthlyCompensationRatingRecord><numberOfSMCParagraphRecords>1</numberOfSMCParagraphRecords><numberOfSMCRecords>0</numberOfSMCRecords><returnCode>SHAR
        9999</returnCode><returnMessage>Records found</returnMessage><smcParagraphRatings><profileDate>12212018</profileDate><ratingID>134247</ratingID><smcParagraphKeyTypeName>K-1</smcParagraphKeyTypeName><smcParagraphText>Entitled
        to special monthly compensation under 38 U.S.C. 1114, subsection (k) and 38
        CFR 3.350(a) on</smcParagraphText></smcParagraphRatings></specialMonthlyCompensationRatingRecord></return></ns0:findRatingDataResponse></S:Body></S:Envelope>
    http_version: null
  recorded_at: Wed, 06 May 2020 13:59:07 GMT
recorded_with: VCR 5.1.0
